app/Helpers/custom_helper.php

    function userLogin() {
        $db = \Config\Database::connect();
        return $db->table('tb_admin')->where('id', session('id'))->get()->getRow();
---
SELECT *
FROM `tb_admin`
WHERE `id` = '2'