app/Controllers/Auth.php

SELECT *
FROM `tb_admin`
WHERE `username` = 'admin'
---
    public function loginProcess() {
        $post = $this->request->getPost();
        $query = $this->admin->table('tb_admin')->getWhere(['username' => $post['username']]);